.config/doom-mac/config.org
#+TITLE: THE DOOM CONFIG
#+SUBTITLE: All my Doom Emacs Configuration Files
#+AUTHOR: Cristian D. Moreno - Kyonax
#+EMAIL: kyonax.corp@gmail.com
#+DATE: June 20, 2025
#+LAST_UPDATE: November 07, 2025
#+PROJECT: dot-files
#+VERSION: v1.0
#+KEYWORDS: emacs, docs, doom config
#+auto_tangle: t

This ain't an average *doom-config file*, this is the master index of my entire Doom Emacs setup. Just one file, locked on generating the necessary tweaks to maintain my setup across all OS. My master file, jacked to fit my pesonal needs. Use it as your blueprint, but don't even think about PRs.

* MAINTABLE OF CONTENTs :toc:
- [[#main][MAIN]]
  - [[#os-prober][OS PROBER]]
  - [[#user--host][USER & HOST]]
  - [[#environment-profile][ENVIRONMENT PROFILE]]
  - [[#identity][IDENTITY]]
- [[#config-files][CONFIG FILEs]]
  - [[#packagesel][packages.el]]
  - [[#configel][config.el]]
  - [[#initel][init.el]]
- [[#custom-functions][CUSTOM FUNCTIONs]]
  - [[#create-invoice-number][CREATE INVOICE NUMBER]]

* MAIN
This file's wired into ~org-mode~ and ~org-babel~, to follow the idea of Literate Programming (in my case for configuration files), that's why is necessary a section to configure all the necessary stuff to make the Master File do magick.

** OS PROBER
One-File for All-OS, my main directive was to create a single file to tangle everything, no matter the OS I'm into. This OS PROBER section is locked on deploying ~org-babel~ and nailing down which blocks get tangled, all hinging on the data pulled from the =get-os-variable= block.

Call the function in a condition when creating the ~:tangle~ property in blocks, to identify if the block will be tangled depending on the OS.

#+NAME: get-os-type
#+begin_src emacs-lisp :tangle no :exports results :results value
(cond ((eq system-type 'gnu/linux)   "linux")
      ((eq system-type 'darwin)      "mac")
      ((eq system-type 'windows-nt)  "windows")
      ((eq system-type 'cygwin)      "cygwin")
      (t "unknown"))
#+end_src

Example of Usage:
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "Hello There I'm on %s" (org-babel-ref-resolve "get-os-type"))
#+end_src

** USER & HOST
*Multi-OS, One Setup* — I keep a unified configuration across all my systems, but each OS comes with its own users, hosts, and unique context. Depending on whether I’m using Emacs for work, personal projects, or any other scenario, certain configurations adapt dynamically. This setup helps me instantly recognize where I am and ensures the right configuration loads for the right environment.

#+NAME: get-username
#+begin_src emacs-lisp :tangle no :exports results :results value
(let ((os (org-babel-ref-resolve "get-os-type")))
  (cond
   ((string= os "linux")   (user-login-name))
   ((string= os "mac")     (user-login-name))
   ((string= os "windows") (getenv "USERNAME"))
   ((string= os "cygwin")  (getenv "USERNAME"))
   (t "unknown-user")))
#+end_src

#+NAME: get-hostname
#+begin_src emacs-lisp :tangle no :exports results :results value
(let ((os (org-babel-ref-resolve "get-os-type")))
  (cond
   ((member os '("linux" "mac"))
    (string-trim (shell-command-to-string "hostname")))
   ((member os '("windows" "cygwin"))
    (or (getenv "COMPUTERNAME") "unknown-host"))
   (t "unknown-host")))
#+end_src

Example of Usage:
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "This is my Username %s" (org-babel-ref-resolve "get-username"))
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "This is my Hostname %s" (org-babel-ref-resolve "get-hostname"))
#+end_src

** ENVIRONMENT PROFILE
*Profile Selector* — This is where I choose the active profile to ensure each environment loads the right configuration for the context I’m in.

#+NAME: get-profile
#+begin_src emacs-lisp :tangle no :exports results :results value
(let* ((hostname (downcase (org-babel-ref-resolve "get-hostname"))))
  (cond
   ((string-match-p "kyo-labs" hostname) "personal-linux")
   ((string-match-p "MacBook-Pro-de-COL-AE-052.local" hostname) "work-mac")
   (t "default")))
#+end_src

Example of Usage:
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "This is my Profile %s" (org-babel-ref-resolve "get-profile"))
#+end_src

** IDENTITY
*Who Am I?* — Depending on the active profile, I can be anyone. My identity, along with settings for tools, templates, and other resources, updates automatically to match that context.

#+NAME: get-name
#+begin_src emacs-lisp :tangle no :exports results :results value
(let* ((profile (org-babel-ref-resolve "get-profile")))
  (cond
   ((string= profile "personal-linux")
    "Cristian D. Moreno - Kyonax")
   ((string= profile "work-mac")
    "Cristian D. Moreno - Agile Engine")
   (t "Cristian D. Moreno")))
#+end_src

#+NAME: get-email
#+begin_src emacs-lisp :tangle no :exports results :results value
(let* ((profile (org-babel-ref-resolve "get-profile")))
  (cond
   ((string= profile "personal-linux")
    "kyonax.corp@gmail.com")
   ((string= profile "work-mac")
    "cristian.moreno@agileengine.com")
   (t "kyonax.corp@gmail.com")))
#+end_src

*Example of Usage:*
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "This is my Profile %s" (org-babel-ref-resolve "get-name"))
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "os") "config.el" "no")
(message "This is my Profile %s" (org-babel-ref-resolve "get-email"))
#+end_src

* CONFIG FILEs
** packages.el
Doom comes with the Default package manager for Doom Emacs, where all the packages will be installed when the command ~doom sync~ is run by the user.

*** DEFAULT FILE DOCUMENTATION
#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/radian-software/straight.el#the-recipe-format
;; (package! another-package
;;   :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;; (package! this-package
;;   :recipe (:host github :repo "username/repo"
;;            :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;; (package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;; (package! builtin-package :recipe (:nonrecursive t))
;; (package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see radian-software/straight.el#279)
;; (package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;; (package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;; (unpin! pinned-package)
;; ...or multiple packages
;; (unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;; (unpin! t)
#+end_src

*** BEACON
#+begin_src emacs-lisp :tangle packages.el
(package! beacon)
#+end_src
*** BIBLIO
#+begin_src emacs-lisp :tangle packages.el
(package! bibtex-completion)
(package! parsebib)
(package! ivy-bibtex)
#+end_src
*** CALENDAR
#+begin_src emacs-lisp :tangle packages.el
(package! calfw)
(package! calfw-org)
(package! org-gcal)
#+end_src

*** CAPE
#+begin_src emacs-lisp :tangle packages.el
(package! cape)
#+end_src

*** CLIPPY
#+begin_src emacs-lisp :tangle packages.el
(package! clippy)
#+end_src

*** CORFU
#+begin_src emacs-lisp :tangle packages.el
(package! corfu)
(package! nerd-icons-corfu)
(package! orderless)
(package! corfu-terminal)
#+end_src
*** DEFAULT
#+begin_src emacs-lisp :tangle packages.el
(package! drag-stuff)
#+end_src

*** DIRED-OPEN
#+begin_src emacs-lisp :tangle packages.el
(package! dired-open)
#+end_src

*** DIRED-SUBTREE
#+begin_src emacs-lisp :tangle packages.el
(package! dired-subtree)
#+end_src

*** EDITORCONFIG
#+begin_src emacs-lisp :tangle packages.el
(package! editorconfig)
#+end_src

*** ELFEEDED-GOODIES
#+begin_src emacs-lisp :tangle packages.el
(package! elfeed-goodies)
#+end_src

*** EMOJIFY
#+begin_src emacs-lisp :tangle packages.el
(package! emojify)
#+end_src

*** EVIL
#+begin_src emacs-lisp :tangle packages.el
(package! evil-tutor)
(package! evil-nerd-commenter)
#+end_src

*** FLX
#+begin_src emacs-lisp :tangle packages.el
(package! flx)
#+end_src

*** FOLD
#+begin_src emacs-lisp :tangle packages.el
(package! treesit-fold)
#+end_src

*** GPTEL
#+begin_src emacs-lisp :tangle packages.el
(package! gptel)
(package! gptel-quick)
(package! gptel-magit)
#+end_src

*** IVY
#+begin_src emacs-lisp :tangle packages.el
(package! ivy-hydra)
(package! ivy-posframe)
(package! ivy-prescient)
(package! nerd-icons-ivy-rich)
#+end_src

*** LANG
#+begin_src emacs-lisp :tangle packages.el
(package! opencl-mode)
(package! ccls)

(package! flycheck-cask)

(package! cdlatex)

(package! grip-mode)
(package! markdown-ts-mode)

(package! org-fancy-priorities)
(package! org-superstar)
(package! org-contacts)
(package! org-download)
(package! gnuplot)
(package! gnuplot-mode)
(package! ox-hugo)
(package! jupyter)
(package! org-noter)
(package! ox-pandoc)
(package! org-passwords)
(package! org-pomodoro)
(package! centered-window)
(package! org-tree-slide)
(package! org-re-reveal)
(package! org-appear)
(package! org-modern)
(package! org-roam)

(package! restclient-jq)
(package! jq-mode)

(package! swift-ts-mode)
(package! lsp-sourcekit)

(package! counsel-css)
(package! emmet-mode)
(package! haml-mode)
(package! pug-mode)
(package! rainbow-mode)
(package! sass-mode)
(package! slim-mode)
(package! stylus-mode)
(package! sws-mode)
(package! web-mode)
(package! yaml-mode)
#+end_src

*** LOOKUP
#+begin_src emacs-lisp :tangle packages.el
(when (modulep! :tools lookup +docsets)
  (package! dash-docs)
  (package! counsel-dash))
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "mac") "packages.el" "no")
(package! osx-dictionary)
#+end_src

*** LSP
#+begin_src emacs-lisp :tangle packages.el
(package! lsp-mode)
(package! lsp-ui)
(package! lsp-ivy)
#+end_src

*** MAGIT
#+begin_src emacs-lisp :tangle packages.el
(package! evil-magit)
(package! forge)
(package! code-review)
#+end_src

*** MACOS
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "mac") "packages.el" "no")
(package! osx-trash)
#+end_src

*** MULTIPLE-CURSORS
#+begin_src emacs-lisp :tangle packages.el
(package! multiple-cursors)
#+end_src

*** OLIVETTI
#+begin_src emacs-lisp :tangle packages.el
(package! olivetti)
#+end_src

*** ORDERLESS
#+begin_src emacs-lisp :tangle packages.el
(package! orderless)
#+end_src

*** ORG-AUTO-TANGLE
#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src

*** ORG-BULLETS
#+begin_src emacs-lisp :tangle packages.el
(package! org-bullets)
#+end_src

*** ORG-WEB-TOOLS
#+begin_src emacs-lisp :tangle packages.el
(package! org-web-tools)
#+end_src

*** PASSWORD-STORE
#+begin_src emacs-lisp :tangle packages.el
(package! password-store)
#+end_src

*** PEEP-DIRED
#+begin_src emacs-lisp :tangle packages.el
(package! peep-dired)
#+end_src

*** RAINBOW-MODE
#+begin_src emacs-lisp :tangle packages.el
(package! rainbow-mode)
#+end_src

*** RESIZE-WINDOW
#+begin_src emacs-lisp :tangle packages.el
(package! resize-window)
#+end_src
*** SYNTAX
#+begin_src emacs-lisp :tangle packages.el
(package! flycheck-posframe)
#+end_src

*** TLDR
#+begin_src emacs-lisp :tangle packages.el
(package! tldr)
#+end_src

*** TREEMACS
#+begin_src emacs-lisp :tangle packages.el
(package! lsp-treemacs)
#+end_src

*** WC-MODE
#+begin_src emacs-lisp :tangle packages.el
(package! wc-mode)
#+end_src

*** WEB-MODE
#+begin_src emacs-lisp :tangle packages.el
(package! web-mode)
#+end_src
*** WINDOW-SELECT
#+begin_src emacs-lisp :tangle packages.el
(package! winum)
#+end_src

*** WORD-WRAP
#+begin_src emacs-lisp :tangle packages.el
(package! visual-fill-column)
#+end_src

*** ORG-ROAM-UI
#+begin_src emacs-lisp :tangle packages.el
(unpin! org-roam company-org-roam)
(package! org-roam-ui)
#+end_src

*** YASNIPPETS
#+begin_src emacs-lisp :tangle packages.el
(package! yasnippet-capf)
#+end_src

** config.el
*** EDITOR DEFAULTs
**** BEACON PACKAGE
Setup the ~beacon~ package to never lose the cursor. Shiny cursor interaction when moving.
#+begin_src emacs-lisp :tangle config.el
(use-package beacon
  :config
  (beacon-mode 1))

(setq evil-escape-key-sequence "jk")
#+end_src

**** BOOKMARKs
Setup the ~bookmarks~ for the editor.

- *Keybindings Bookmarks*
| COMMAND         | DESCRIPTION                            | KEYBINDING |
|-----------------+----------------------------------------+------------|
| list-bookmarks  | /List bookmarks/                         | SPC b L    |
| bookmark-set    | /Set bookmark/                           | SPC b m    |
| bookmark-delete | /Delete bookmark/                        | SPC b M    |
| bookmark-save   | /Save current bookmark to bookmark file/ | SPC b w    |

#+begin_src emacs-lisp :tangle config.el
(setq bookmark-default-file "~/.brain.d/bookmarks/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+end_src

