.config/doom-mac/config.org
**** EDITORCONFIG PACKAGE
Enable the usage of ~editorconfig~ package. Consistency while develop [[https://github.com/editorconfig/editorconfig-emacs#readme][Read More]].
#+begin_src emacs-lisp :tangle config.el
(setq +file-templates-dir (expand-file-name "templates" doom-user-dir))

(use-package editorconfig
  :ensure t
  :hook (after-init . editorconfig-mode)
  :config
  (setq editorconfig-exclude-modes '(archive-mode
                                     image-mode
                                     pdf-view-mode))
  (setq editorconfig-trim-whitespaces-mode 'ws-butler-mode)

  ;; Espera a que cargue el major-mode antes de aplicar settings
  (setq editorconfig-lazy-major-mode t)
  (setq editorconfig-verbose nil))
#+end_src

**** FILE CODING SYSTEM
Set the File Coding System always to unix, this configuration is tweaked to maintain consistency across OS, used just on ~windows~ setup.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(set-buffer-file-coding-system 'utf-8-unix)
#+end_src

*Checker:*
#+begin_src emacs-lisp :tangle no
(message "%s" buffer-file-coding-system)
#+end_src

**** FONTs
Set the default fonts used across Emacs. There is just one font used right now in my Config:
- *Space Mono Nerd Font* [[https://www.nerdfonts.com/font-downloads][Nerd Fonts Website]].
#+begin_src emacs-lisp :tangle config.el
(setq doom-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-variable-pitch-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-big-font (font-spec :family "SpaceMono Nerd Font Mono" :size 18))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

**** GIT-SSH ASKPASS
Setup the =gui askpass=, to fill the passphrase with a GUI interface.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(setenv "SSH_ASKPASS" "C:/Program Files/Git/mingw64/libexec/git-core/git-gui--askpass")

(setenv "SSH_AUTH_SOCK" "\\\\.\\pipe\\openssh-ssh-agent")
#+end_src

**** TRUNCATE LINEs
Set a toggle keymap for ~truncated lines~, this is a toggle function.
#+begin_src emacs-lisp :tangle config.el
(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)
#+end_src

**** MELPA
Configure Melpa and enable the ~MELPA Stable~ packages repo. Comment the Stable configuration if not necessary the Stable version.
#+begin_src emacs-lisp :tangle config.el
(use-package package
  :config
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize))
#+end_src

**** MODELINE PACKAGE
Setup the ~modeline~ package, this is the bottom status bar that appears in Emacs Windows. The Configuration is based on personal preferences to more information [[https://github.com/seagle0128/doom-modeline][Read More]].
#+begin_src emacs-lisp :tangle config.el
(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :init
  (setq doom-modeline-height 33
        doom-modeline-bar-width 6
        doom-modeline-icon t
        doom-modeline-major-mode-icon t
        doom-modeline-major-mode-color-icon t
        doom-modeline-buffer-file-name-style 'relative-to-project
        doom-modeline-minor-modes nil
        doom-modeline-enable-word-count nil
        doom-modeline-buffer-encoding t
        doom-modeline-indent-info t
        doom-modeline-vcs-max-length 15
        doom-modeline-persp-name t
        doom-modeline-persp-icon t
        doom-modeline-lsp t
        doom-modeline-github t
        doom-modeline-github-interval (* 15 60)
        doom-modeline-env-version t
        doom-modeline-mu4e nil
        doom-modeline-irc nil)
  :config
  (when (display-graphic-p)
    (set-face-attribute 'mode-line nil :font "SpaceMono Nerd Font Mono"))
  (doom-modeline-mode 1))
#+end_src

**** SERVER SOCKET
Generate the ~server-socket~ on a specific location. Daemon performance requirements.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(use-package server
  :config
  (setq server-use-tcp t
      server-socket-dir "~/.config/emacs/server"))
#+end_src

**** SHELL FOR COMPILATION
Setup the default ~shell~ to use for compilation. Create a toggle function for Windows to use Cygwin.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(defun kyo/toggle-shell-cygwin ()
  "Toggle between PowerShell and Cygwin as the default shell."
  (interactive)
  (if (string= shell-file-name "~/scoop/apps/pwsh/7.5.0/pwsh.exe")
      (setq shell-file-name "C:/cygwin/bin/bash.exe")
    (setq shell-file-name "~/scoop/apps/pwsh/7.5.0/pwsh.exe"))
  (message "Shell toggled to: %s" shell-file-name))

(setq shell-file-name "~/scoop/apps/pwsh/7.5.0/pwsh.exe")

(map! :leader
      :desc "Toggle Shells between PowerShell and Cygwin."
      "t h" #'kyo/toggle-shell-cygwin)
#+end_src

**** STARTUP WINDOW
Setup the ~doom-dashboard~ window to a customized one.
#+begin_src emacs-lisp :tangle no
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "I am Kyo")))

(defun kyo/my-shit-is-always-greater ()
  (let* ((banner '(
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣧⡀⣿⣤⣀⣾⣅⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣤⣤⠲⠶⣦⡿⣿⣿⣿⣿⣿⣿⣿⣴⣴⠖⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⢲⣦⣿⣟⠛⡓⣀⠐⠋⢽⠟⡿⢿⣿⣿⢛⢷⣤⣤⠄⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠠⢤⣦⣤⡦⠆⢈⢋⣡⡔⠁⢀⡠⠐⢻⡿⢃⡄⠀⣿⣧⣤⣀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⣀⣴⣾⡿⠗⡪⢛⣿⣿⣷⢾⡟⠀⣊⣴⣷⣿⢧⣦⣿⣿⢿⣁⣀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⢈⡬⠟⠂⠀⠖⠀⠞⠉⡽⠃⢈⠡⢋⠏⡰⠀⡿⠈⠛⣿⡇⠸⢢⡀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠊⠄⠁⠀⠐⣀⣪⢀⣔⡤⠂⣠⢀⡴⠀⣡⡀⠁⠈⠃⡢⠡⣄⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠄⠀⢤⣜⣉⡛⠻⢿⣷⣿⣿⣾⣷⡾⠿⠷⠆⢁⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⣾⠧⣬⣍⣑⠢⣽⣿⣿⣋⡤⠴⠒⢛⣳⣧⠀⠈⠀⢤⡄⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⣤⣧⠀⡄⢿⣧⡙⠛⠻⣤⣿⣿⣿⣿⣠⣿⡿⠟⣹⡧⠐⠠⠠⣿⡧⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⣠⣾⣿⣿⣧⡀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣾⡿⠁⢋⡄⠐⣿⣿⠀⠀⠀⠀"
                   "⠀⠀⢀⣼⣿⣿⣿⣿⣟⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⣿⡧⠀⣿⣿⡀⣧⠀⠀"
                   "⠀⠀⣿⣿⣿⣿⣿⠛⢿⣷⡄⢢⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⠟⢁⠀⠀⢛⣩⣴⣿⡿⢃⡌⠀⠀"
                   "⠀⠀⠙⣿⣿⣿⣿⣿⣶⣌⠻⢦⡁⠀⠻⣿⣿⣿⣿⠿⠋⠀⣘⣡⣶⣿⡿⠟⣛⣡⠶⢋⠄⠀⠀"
                   "⠀⠀⠀⠈⠻⠿⡿⡿⣿⣿⣿⣦⣙⠢⠀⠀⠈⠈⣀⣤⣶⣿⣟⢛⡩⠔⣒⣩⣥⣤⣶⣿⠂⠀⠀"
                   "⠀⠀⠀⠀⠀⠰⣶⣦⣦⣦⡙⢿⡿⠓⣀⣠⣴⣿⣿⣿⡿⢛⣩⣴⣾⣿⡿⠿⠛⠋⠉⠁⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠈⠙⠻⢿⣿⣦⣅⠘⠿⠋⠁⢈⠟⣫⣿⣿⠿⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⠃⠐⡄⠀⠁⡺⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"
                   ))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'kyo/my-shit-is-always-greater)

(custom-set-faces!
  '(doom-dashboard-banner :foreground "#9FE573" :background "#000000" :weight bold)
  '(doom-dashboard-loaded :foreground "#9FE573" :background "#000000" :weight bold))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "@kyonax_on_tech")))

(defun kyo/my-shit-is-always-greater ()
  (let* ((banner '(
                   "                                                             "
                   "                         ███████████      █████              "
                   "                     █████████████████████████               "
                   "                  ███████████████████████████                "
                   "                █████████████████████████████                "
                   "               ████████████       ████████████               "
                   "              ██████████          █████████████              "
                   "              █████████          ██████████████              "
                   "             ██████████         █████ ██████████             "
                   "             ██████████       ██████  ██████████             "
                   "             ██████████      ██████   ██████████             "
                   "             ██████████     █████     ██████████             "
                   "             ██████████   ██████      ██████████             "
                   "             ██████████  ██████       ██████████             "
                   "             ██████████ █████         ██████████             "
                   "              ██████████████         ██████████              "
                   "              █████████████         ███████████              "
                   "               ████████████       ████████████               "
                   "                █████████████████████████████                "
                   "                ███████████████████████████                  "
                   "               █████████████████████████                     "
                   "             ██████     ████████████                         "
                   "                                                             "
                   "                        zerønet labs                         "
                   "                     Cristian D. Moreno                      "
                   "                                                             "
                   "                                                             "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line
                        (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'kyo/my-shit-is-always-greater)

(custom-set-faces!
  '(doom-dashboard-banner :foreground "#9FE573" :background "#000000" :weight bold)
  '(doom-dashboard-loaded :foreground "#9FE573" :background "#000000" :weight bold))
#+end_src

