.config/doom-mac/config.el

(setq +file-templates-dir (expand-file-name "templates" doom-user-dir))

(use-package editorconfig
  :ensure t
  :hook (after-init . editorconfig-mode)
  :config
  (setq editorconfig-exclude-modes '(archive-mode
                                     image-mode
                                     pdf-view-mode))
  (setq editorconfig-trim-whitespaces-mode 'ws-butler-mode)

  ;; Espera a que cargue el major-mode antes de aplicar settings
  (setq editorconfig-lazy-major-mode t)
  (setq editorconfig-verbose nil))

(setq doom-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-variable-pitch-font (font-spec :family "SpaceMono Nerd Font Mono" :size 11)
      doom-big-font (font-spec :family "SpaceMono Nerd Font Mono" :size 18))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)

(use-package package
  :config
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize))

(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :init
  (setq doom-modeline-height 33
        doom-modeline-bar-width 6
        doom-modeline-icon t
        doom-modeline-major-mode-icon t
        doom-modeline-major-mode-color-icon t
        doom-modeline-buffer-file-name-style 'relative-to-project
        doom-modeline-minor-modes nil
        doom-modeline-enable-word-count nil
        doom-modeline-buffer-encoding t
        doom-modeline-indent-info t
        doom-modeline-vcs-max-length 15
        doom-modeline-persp-name t
        doom-modeline-persp-icon t
        doom-modeline-lsp t
        doom-modeline-github t
        doom-modeline-github-interval (* 15 60)
        doom-modeline-env-version t
        doom-modeline-mu4e nil
        doom-modeline-irc nil)
  :config
  (when (display-graphic-p)
    (set-face-attribute 'mode-line nil :font "SpaceMono Nerd Font Mono"))
  (doom-modeline-mode 1))

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)

(add-hook! '+doom-dashboard-functions :append
  (insert "\n" (+doom-dashboard--center +doom-dashboard--width "@kyonax_on_tech")))

(defun kyo/my-shit-is-always-greater ()
  (let* ((banner '(
                   "                                                             "
                   "                         ███████████      █████              "
                   "                     █████████████████████████               "
                   "                  ███████████████████████████                "
                   "                █████████████████████████████                "
                   "               ████████████       ████████████               "
                   "              ██████████          █████████████              "
                   "              █████████          ██████████████              "
                   "             ██████████         █████ ██████████             "
                   "             ██████████       ██████  ██████████             "
                   "             ██████████      ██████   ██████████             "
                   "             ██████████     █████     ██████████             "
                   "             ██████████   ██████      ██████████             "
                   "             ██████████  ██████       ██████████             "
                   "             ██████████ █████         ██████████             "
                   "              ██████████████         ██████████              "
                   "              █████████████         ███████████              "
                   "               ████████████       ████████████               "
                   "                █████████████████████████████                "
                   "                ███████████████████████████                  "
                   "               █████████████████████████                     "
                   "             ██████     ████████████                         "
                   "                                                             "
                   "                        zerønet labs                         "
                   "                     Cristian D. Moreno                      "
                   "                                                             "
                   "                                                             "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line
                        (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'kyo/my-shit-is-always-greater)

(custom-set-faces!
  '(doom-dashboard-banner :foreground "#9FE573" :background "#000000" :weight bold)
  '(doom-dashboard-loaded :foreground "#9FE573" :background "#000000" :weight bold))
