.config/doom-mac/config.org
**** THEME
Set the default theme of Emacs with the next elisp code. See some ~theme~ options:
- *doom-monokai-pro*
- *doom-monokai-spectrum*
- *gruber-darker*

Load a new Theme using the Keybinding ~"SPC h t"~ and select the Theme.
#+begin_src emacs-lisp :tangle config.el
(setq doom-theme 'doom-monokai-spectrum)
(map! :leader
      :desc "Load new theme" "h t" #'counsel-load-theme)
#+end_src

**** TREEMASCS PACKAGE
Setup the ~treemacs~ package used as a File Manager.
#+begin_src emacs-lisp :tangle config.el
(use-package treemacs
  :config
  (setq evil-treemacs-state-cursor t
        treemacs-show-cursor t
        treemacs-width 39))
#+end_src

**** UI
Set Default configuration for the UI of the Emacs Editor.
#+begin_src emacs-lisp :tangle config.el
(setq display-line-numbers-type 'relative
      display-line-numbers-mode t
      line-number-mode t)
#+end_src

**** LSP-UI
LSP UI Defalts
#+begin_src emacs-lisp :tangle config.el
(setq lsp-ui-doc-show-with-cursor t)
(setq lsp-ui-doc-delay 0.2)

(map! :leader
      :desc "Show LSP UI Doc"
      "c d" #'lsp-ui-doc-show)
#+end_src

*** EDITOR MODEs
**** SCSS-MODE
Setup the ~scss-mode~ package to use it on all SCSS files with LSP and linters.
#+begin_src emacs-lisp :tangle config.el
(use-package scss-mode
  :mode ("\\.scss\\'" . scss-mode)
  :hook ((scss-mode . lsp-deferred)
         (scss-mode . flycheck-mode)
         (scss-mode . whitespace-mode)
         (scss-mode . prettier-js-mode))
  :config
  (setq css-indent-offset 2))
#+end_src

**** CSS-MODE
Setup the ~css-mode~ package to use it on all CSS files with LSP and linters.
#+begin_src emacs-lisp :tangle config.el
(use-package css-mode
  :mode ("\\.css\\'" . css-mode)
  :hook ((css-mode . lsp-deferred)
         (css-mode . flycheck-mode)
         (css-mode . whitespace-mode)
         (css-mode . prettier-js-mode))
  :config
  (setq css-indent-offset 2))
#+end_src

**** JS2-MODE
Setup the ~js2-mode~ package to use it on all the Javascript Files.
#+begin_src emacs-lisp :tangle config.el
(defun kyo/js2-mode-setup ()
  (js2-minor-mode))

(use-package js2-mode
  :mode (("\\.plugin\\.js\\'" . js2-mode)
         ("\\.js\\'" . js2-mode)
         ("\\.jsx\\'" . js2-mode)
         ("\\.mjs\\'" . js2-mode)
         ("\\.cjs\\'" . js2-mode)
         ("\\.es6\\'" . js2-mode))
  :interpreter ("javascript" . js2-mode)
  :hook ((js2-mode . lsp-deferred)
         (js2-mode . kyo/js2-mode-setup)))
#+end_src

**** TYPESCRIPT-MODE
Setup the ~typescript-mode~ package to use it on all the TS Files.
#+begin_src emacs-lisp :tangle config.el
(use-package typescript-mode
  :mode (("\\.ts\\'" . typescript-mode)
         ("\\.tsx\\'" . typescript-mode))
  :hook (typescript-mode . lsp-deferred))
 #+end_src

**** JSON-MODE
Setup the ~json-mode~ package to use it on all the Json Files.
#+begin_src emacs-lisp :tangle config.el
(use-package json-mode
  :mode ("\\.json\\'" . json-mode))
#+end_src

**** LSP-MODE
Setting up the ccls (C/C++/Objective-C language server) to use with ~lsp~.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(after! ccls
  (setq ccls-executable "C:/ProgramData/chocolatey/bin/ccls.exe")
  (set-lsp-priority! 'ccls 0))
#+end_src

Setup the ~lsp-mode~ package to use it on the main languages that I work with.
#+begin_src emacs-lisp :tangle no
(defun kyo/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode)
  (lsp-ui-sideline-toggle-symbols-info))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(defun kyo/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((js2-mode . lsp-mode)
         (typescript-mode . lsp-mode)
         (web-mode . lsp-mode)
         (lsp-mode . kyo/lsp-mode-setup))

  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook ((js2-mode . lsp-ui-mode)
         (typescript-mode . lsp-ui-mode)
         (web-mode . lsp-ui-mode)))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq lsp-solargraph-use-bundler t)

(with-eval-after-load 'lsp-mode
  (add-to-list 'lsp-language-id-configuration '(ruby-mode . "ruby"))
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("solargraph" "stdio"))
                    :major-modes '(ruby-mode)
                    :priority -1
                    :server-id 'ruby-ls)))
#+end_src

**** ORG-MODE
Setup the ~org-mode~ package to use the magick on my Org Files.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-profile") "personal-linux") "config.el" "no")
(defvar my-org-todo-keywords
  '("TODO(t)"    ; A task that is ready to be tackled
    "CODE(m)"    ; Coding Tasks
    "TEST(c)"    ; Blog writing assignments
    "DEVELOP(d)" ; Things to develop
    "MEET(5)"    ; A Meeting
    "PROYECT(p)" ; A project that contains other tasks
    "REVIEW(r)"  ; A project that contains other tasks
    "WAIT(w)"    ; Something is holding up this task
    "|"          ; Separates active from inactive states
    "DONE(d)"    ; Task has been completed
    "CANCELLED(c)")  ; Task has been cancelled
  "List of Org todo keywords for the sequence.")
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-profile") "work-mac") "config.el" "no")
(defvar my-org-todo-keywords
  '("TODO(t)"        ; A task that is ready to be tackled
    "CODE(m)"        ; Coding Tasks
    "TEST(s)"        ; Blog writing assignments
    "DEVELOP(o)"     ; Things to develop
    "MEET(5)"        ; A Meeting
    "PROYECT(p)"     ; A project that contains other tasks
    "REVIEW(r)"      ; A project that contains other tasks
    "WAIT(w)"        ; Something is holding up this task
    "|"              ; Separates active from inactive states
    "DONE(d)"        ; Task has been completed
    "CANCELLED(c)")  ; Task has been cancelled
  "List of Org todo keywords for the sequence.")
#+end_src

#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq org-directory "~/org"
        org-ellipsis " ▼ "
        org-hide-emphasis-markers t))

(after! org-superstar
  (setq org-superstar-headline-bullets-list '("" "" "" "󰺕" "󰻂" "󰪥" "󰻃")
        org-superstar-itembullet-alist '((?+ . ?➤)
                                         (?- . ?✦))))

(after! org
  (setq org-todo-keywords `((sequence ,@my-org-todo-keywords))))
#+end_src

