.config/doom-mac/config.el

(setq doom-theme 'doom-monokai-spectrum)
(map! :leader
      :desc "Load new theme" "h t" #'counsel-load-theme)

(use-package treemacs
  :config
  (setq evil-treemacs-state-cursor t
        treemacs-show-cursor t
        treemacs-width 39))

(setq display-line-numbers-type 'relative
      display-line-numbers-mode t
      line-number-mode t)

(setq lsp-ui-doc-show-with-cursor t)
(setq lsp-ui-doc-delay 0.2)

(map! :leader
      :desc "Show LSP UI Doc"
      "c d" #'lsp-ui-doc-show)

(use-package scss-mode
  :mode ("\\.scss\\'" . scss-mode)
  :hook ((scss-mode . lsp-deferred)
         (scss-mode . flycheck-mode)
         (scss-mode . whitespace-mode)
         (scss-mode . prettier-js-mode))
  :config
  (setq css-indent-offset 2))

(use-package css-mode
  :mode ("\\.css\\'" . css-mode)
  :hook ((css-mode . lsp-deferred)
         (css-mode . flycheck-mode)
         (css-mode . whitespace-mode)
         (css-mode . prettier-js-mode))
  :config
  (setq css-indent-offset 2))

(defun kyo/js2-mode-setup ()
  (js2-minor-mode))

(use-package js2-mode
  :mode (("\\.plugin\\.js\\'" . js2-mode)
         ("\\.js\\'" . js2-mode)
         ("\\.jsx\\'" . js2-mode)
         ("\\.mjs\\'" . js2-mode)
         ("\\.cjs\\'" . js2-mode)
         ("\\.es6\\'" . js2-mode))
  :interpreter ("javascript" . js2-mode)
  :hook ((js2-mode . lsp-deferred)
         (js2-mode . kyo/js2-mode-setup)))

(use-package typescript-mode
  :mode (("\\.ts\\'" . typescript-mode)
         ("\\.tsx\\'" . typescript-mode))
  :hook (typescript-mode . lsp-deferred))

(use-package json-mode
  :mode ("\\.json\\'" . json-mode))

(defun kyo/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((js2-mode . lsp-mode)
         (typescript-mode . lsp-mode)
         (web-mode . lsp-mode)
         (lsp-mode . kyo/lsp-mode-setup))

  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook ((js2-mode . lsp-ui-mode)
         (typescript-mode . lsp-ui-mode)
         (web-mode . lsp-ui-mode)))

(defvar my-org-todo-keywords
  '("TODO(t)"        ; A task that is ready to be tackled
    "CODE(m)"        ; Coding Tasks
    "TEST(s)"        ; Blog writing assignments
    "DEVELOP(o)"     ; Things to develop
    "MEET(5)"        ; A Meeting
    "PROYECT(p)"     ; A project that contains other tasks
    "REVIEW(r)"      ; A project that contains other tasks
    "WAIT(w)"        ; Something is holding up this task
    "|"              ; Separates active from inactive states
    "DONE(d)"        ; Task has been completed
    "CANCELLED(c)")  ; Task has been cancelled
  "List of Org todo keywords for the sequence.")

(after! org
  (setq org-directory "~/org"
        org-ellipsis " ▼ "
        org-hide-emphasis-markers t))

(after! org-superstar
  (setq org-superstar-headline-bullets-list '("" "" "" "󰺕" "󰻂" "󰪥" "󰻃")
        org-superstar-itembullet-alist '((?+ . ?➤)
                                         (?- . ?✦))))

(after! org
  (setq org-todo-keywords `((sequence ,@my-org-todo-keywords))))
