.config/doom-mac/config.org
***** ROAM
Setup the ~org-roam~ package to use the ~brain~ notes.
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-profile") "personal-linux") "config.el" "no")
(defvar my-org-roam-capture-templates
  '(
    ("d" "default" plain "%?"
     :if-new (file+head "%<%Y-%m-%d-$S>-${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("s" "Not Time Stamp File" plain "%?"
     :if-new (file+head "${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("f" "New Feature Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeTemplate.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t)
    ("i" "New Sentinel Inspection" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeSentinelInspection.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: Kyonax's Daily Sentinel Inspection ~ %<%d/%m/%Y> \n")
     :unnarrowed t)
    ("v" "New Invoice" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeInvoice.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: Invoice ${Client Name}\n#+AUTHOR: %^{Author | Cristian D. Moreno - Kyonax}\n")
     :unnarrowed t)
    ("p" "New PBI Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeProject.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t))
  "My custom Org Roam personal capture templates.")
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-profile") "work-mac") "config.el" "no")
(defvar my-org-roam-capture-templates
  '(
    ("d" "default" plain "%?"
     :if-new (file+head "%<%Y-%m-%d-$S>-${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("s" "Not Time Stamp File" plain "%?"
     :if-new (file+head "${slug}.org"
                        "#+title: ${title}\n")
     :unnarrowed t)
    ("f" "New Feature Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeTemplate.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t)
    ("i" "New Sentinel Inspection" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeSentinelInspection.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: Kyonax's Daily Sentinel Inspection ~ %<%d/%m/%Y> \n")
     :unnarrowed t)
    ("v" "New Invoice" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeInvoice.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: Invoice ${Client Name}\n#+AUTHOR: %^{Author | Cristian D. Moreno - Kyonax}\n")
     :unnarrowed t)
    ("p" "New PBI Azure DevOps" plain
     (file "~/.brain.d/roam-nodes/templates/NEWNodeProject.org")
     :if-new (file+head "%<%Y-%m-%d-%S>-${slug}.org"
                        "#+TITLE: ${title}\n#+DESCRIPTION: %^{Description}\n#+FILETAGS: %^{File Tags}\n#+AUTHOR: %^{Author}\n")
     :unnarrowed t))
  "My custom Org Roam personal capture templates.")
#+end_src

#+begin_src emacs-lisp :tangle config.el
(after! org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (setq org-roam-directory "~/.brain.d/roam-nodes")
  (setq org-roam-dailies-directory "~/.brain.d/agenda")
  (setq org-roam-completion-everywhere t)
  (setq org-roam-capture-templates `,my-org-roam-capture-templates))
#+end_src

- *Keybindings Org Roam Dailies*
| COMMAND                            | DESCRIPTION                                 | KEYBINDING |
|------------------------------------+---------------------------------------------+------------|
| org-roam-dailies-capture-yesterday | /Create a daily roam node for Yesterday/      | SPC n D Y  |
| org-roam-dailies-capture-yesterday | /Create a daily roam node for Today/          | SPC n D H  |
| org-roam-dailies-capture-tomorrow  | /Create a daily roam node for Tomorrow/       | SPC n D T  |
| org-roam-dailies-capture-date      | /Create a daily roam node using Calendar/     | SPC n D C  |
| org-roam-dailies-goto-date         | /Find a daily roam node from a specific Date/ | SPC n e d  |

#+begin_src emacs-lisp :tangle config.el
(map! :leader
      (:prefix ("n D" . "Create Roam Nodes")
       :desc "Daily Nodes - Yesterday" "Y" #'org-roam-dailies-capture-yesterday
       :desc "Daily Nodes - Today" "H" #'org-roam-dailies-capture-today
       :desc "Daily Nodes - Calendar" "C" #'org-roam-dailies-capture-date
       :desc "Daily Nodes - Tomorrow" "T" #'org-roam-dailies-capture-tomorrow))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(map! :leader
      (:prefix ("n e" . "Find Roam Nodes")
       :desc "Daily Nodes - Date" "d" #'org-roam-dailies-goto-date
       :desc "Daily Nodes - Yesterday" "Y" #'org-roam-dailies-goto-yesterday
       :desc "Daily Nodes - Today" "H" #'org-roam-dailies-goto-today
       :desc "Daily Nodes - Tomorrow" "T" #'org-roam-dailies-goto-tomorrow))
#+end_src

- *Websocket Config:*
#+begin_src emacs-lisp :tangle config.el
(use-package! websocket
    :after org-roam)
(use-package! org-roam-ui
    :after org
    :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

**** RAINBOW-MODE
Set the ~rainbow-mode~ package to displays the actual color for any hex value color.
#+begin_src emacs-lisp :tangle config.el
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )

(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+end_src

**** WEB-MODE
Setup the ~web-mode~ package to use it on all html template files.
#+begin_src emacs-lisp :tangle config.el
(defun kyo/web-mode-setup ()
  (setq web-mode-enable-current-element-highlight t)
  (setq web-mode-enable-current-column-highlight t)
  (setq web-mode-block-padding 2))

(use-package web-mode
  :mode (("\\.html\\'" . web-mode)
         ("\\.html\\.twig\\'" . web-mode))
  :hook (web-mode . kyo/web-mode-setup))
#+end_src

**** FLYCHECK
Add =flycheck= with eslint for JSX/TSX.
#+begin_src emacs-lisp :tangle config.el
(use-package flycheck
  :init (global-flycheck-mode)
  :hook ((js2-mode . flycheck-mode)
         (typescript-mode . flycheck-mode)))
#+end_src

**** WHITESPACE-MODE
Setup the ~whitespace-mode~ package to use it on the main languages that I work with.
#+begin_src emacs-lisp :tangle config.el
(use-package whitespace-mode
  :hook ((js2-mode . whitespace-mode)
         (typescript-mode . whitespace-mode)
         (web-mode . whitespace-mode)
         (php-mode . whitespace-mode)
         (json-mode . whitespace-mode)))
#+end_src

**** PRETTIER (CLI)
Setup Prettier CLI to format ~js2-mode~, ~typescript-mode~, ~web-mode~, and ~json-mode~ files before saving.
Disable LSP formatting and indentation to avoid conflicts.

#+begin_src emacs-lisp :tangle config.el
(use-package prettier-js
  :hook ((js2-mode . prettier-js-mode)
         (typescript-mode . prettier-js-mode)
         (json-mode . prettier-js-mode)
         (web-mode . prettier-js-mode)))

(defun kyo/run-prettier ()
  "Format the current file using the Prettier CLI if available."
  (interactive)
  (when (and buffer-file-name
             (string-match-p
              "\\.\\(js\\|jsx\\|ts\\|tsx\\|mjs\\|cjs\\|es6\\|json\\|html?\\)\\'"
              buffer-file-name))
    (let* ((project-root (locate-dominating-file buffer-file-name "node_modules"))
           (local-prettier (and project-root (expand-file-name "node_modules/.bin/prettier" project-root)))
           (prettier-bin (or (and local-prettier (file-executable-p local-prettier) local-prettier)
                             (executable-find "prettier"))))
      (when prettier-bin
        (shell-command-to-string
         (format "%s --write %s"
                 (shell-quote-argument prettier-bin)
                 (shell-quote-argument buffer-file-name)))
        (revert-buffer t t t)))))
#+end_src

*** USER DEFAULTs
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-profile") "personal-linux") "config.el" "no")
(setq user-full-name "Cristian D. Moreno - Kyonax"
      user-mail-address "kyonax.corp@gmail.com")
#+end_src


#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-profile") "work-mac") "config.el" "no")
(setq user-full-name "Cristian D. Moreno - Agile Engine"
      user-mail-address "cristian.moreno@agileengine.com")
#+end_src

