.config/doom-mac/config.org
*** LATEX PACKAGE
Setup the ~latext~ package to use with org.
#+begin_src emacs-lisp :tangle config.el
(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("org-plain-latex"
                 "\\documentclass{article}
                [NO-DEFAULT-PACKAGES]
                [PACKAGES]
                \\newcommand{\\checkbox}{\\text{[ ]}} % Define \checkbox
                \\newcommand{\\checkedbox}{\\text{[X]}} % Define \checkedbox
                [EXTRA]"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                 ("\\paragraph{%s}" . "\\paragraph*{%s}")
                 ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

(after! org
  ;; Minted config for much better syntax highlightig to src blocks.
  (setq
   org-latex-listings 'minted
   ;; minted calls the pygmentize process and thus needs shell escaping
   org-latex-pdf-process
   '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
     "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
     "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f")
   ;; NOTE I don't actually add minted to the package list, I'll just \usepackage it when needed

   ;;(setq org-latex-pdf-process
   ;;'("latexmk -f -pdf %f")) ; Doesn't work with pdflatex
   ;; Margins
   ;;(add-to-list 'org-latex-packages-alist '("a4paper,margin=1.1in" "geometry"))

   ;; Add 'colorlinks' option to hyperrref, its much prettier
   org-latex-hyperref-template
   "\\hypersetup{
 pdfauthor={%a},
 pdftitle={%t},
 pdfkeywords={%k},
 pdfsubject={%d},
 pdfcreator={%c},
 pdflang={%L},
 colorlinks=true,
 linkcolor={cyan}
}"
   ;; page break after TOC
   org-latex-toc-command "\\tableofcontents\n\\pagebreak\n\n")
  ;; org-latex-minted-options '(("bgcolor" "{white!98!black}"))
  ;; org-latex-minted-options '(("bgcolor" "\\color{white!96!black}"))
  ;; In case I configured hyperref in a separate latex preamble
  ;;(setq org-latex-hyperref-template ""))
  (add-hook! 'org-roam-buffer-prepare-hook
    (setq display-line-numbers nil)))


(setq org-highlight-latex-and-related '(native))

(require 'org-src)
(add-to-list 'org-src-block-faces '("latex" (:inherit default :extend t)))

;; Define the custom checklist symbols in LaTeX
(defun my-org-latex-checklist-filter (text backend info)
  "Replace Org checklist symbols with custom LaTeX symbols."
  (when (org-export-derived-backend-p backend 'latex)
    (let ((text (replace-regexp-in-string "\\[ \\]" "\\\\checkbox" text))
          (text (replace-regexp-in-string "\\[X\\]" "\\\\checkedbox" text)))
      text)))

;; Add the custom filter to the export process
(add-hook 'org-export-filter-final-output-functions
          'my-org-latex-checklist-filter)
#+end_src

*** PDF VIEWER
Configure the ~pdf~ viewer.
#+begin_src emacs-lisp :tangle config.el
(use-package pdf-view
  :hook (pdf-tools-enabled . pdf-view-midnight-minor-mode)
  :hook (pdf-tools-enabled . hide-mode-line-mode)
  :config
  (setq pdf-view-midnight-colors '("#888888" . "#111111")))
#+end_src

*** TRAMP
Setup the ~tramp~ package to be used on Windows.
#+BEGIN_SRC emacs-lisp :tangle config.el
(setq password-cache-expiry nil)
#+END_SRC

- *Tramp Windows Config*
#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "windows") "config.el" "no")
(use-package tramp
  :config
  (add-to-list 'tramp-methods `("plinkw"
                                (tramp-login-program "plink")
                                (tramp-login-args (("-ssh")
                                                   (,(format
                                                      "dockware@127.0.0.1 -pw dockware"))))
                                (tramp-remote-shell "/bin/sh"))))

(when (eq window-system 'w32)
  (setq tramp-default-method "plink")
  (when (and (not (string-match putty-directory (getenv "PATH")))
	     (file-directory-p putty-directory))
    (setenv "PATH" (concat putty-directory ";" (getenv "PATH")))
    (add-to-list 'exec-path putty-directory)))
#+end_src

*** RUBY SET-UP
#+begin_src emacs-lisp :tangle no
(load (expand-file-name "modules/editor.el" doom-user-dir))
(load (expand-file-name "modules/misc.el" doom-user-dir))
(load (expand-file-name "modules/ruby.el" doom-user-dir))
(load (expand-file-name "modules/ruby-autocomplete.el" doom-user-dir))
(load (expand-file-name "modules/term.el" doom-user-dir))
(load (expand-file-name "modules/git.el" doom-user-dir))
(load (expand-file-name "modules/lsp.el" doom-user-dir))
(load (expand-file-name "modules/org.el" doom-user-dir))
(load (expand-file-name "modules/autocomplete.el" doom-user-dir))
#+end_src

** init.el
These are *Doom Emacs’ core modules*. I can enable or disable them simply by uncommenting them, and add custom flags when needed to fine-tune their behavior.

#+begin_quote
ℹ Press =SPC h d h= (or =C-h d h= for non-Vim users) to open Doom’s documentation. There, you’ll find a full index of available modules and the flags they support.
️
You can also hover over a module name or flag and press =K= (=C-c c k= for non-Vim users) to view its documentation, or =gd= (=C-c c d=) to jump directly to its source directory.
#+end_quote

*Header File:*
#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

(doom! :input
       ;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
       ;;chinese
       ;;japanese
       ;;layout            ; auie,ctsrnm is the superior home row
#+end_src

*** COMPLETION
#+begin_src emacs-lisp :tangle init.el

       :completion
       ;;company                        ; the ultimate code completion backend
       (corfu +orderless +icons)        ; complete with cap(f), cape and a flying feather!
       ;;(helm +childframe +icons)      ; the *other* search engine for love and life
       ;;ido                            ; the other *other* search engine...
       (ivy +icons +fuzzy +childframe +prescient)  ; a search engine for love and life
       ;;vertico                        ; the search engine of the future
#+end_src

*** UI
#+begin_src emacs-lisp :tangle init.el

       :ui
       deft                ; notational velocity for Emacs
       doom                ; what makes DOOM look the way it does
       doom-dashboard      ; a nifty splash screen for Emacs
       doom-quit           ; DOOM quit-message prompts when you quit Emacs
       ;;(emoji +unicode)  ; 🙂
       hl-todo             ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       indent-guides       ; highlighted indent columns
       (ligatures +extras) ; ligatures and symbols to make your code pretty again
       ;;minimap           ; show a map of the code on the side
       modeline            ; snazzy, Atom-inspired modeline, plus API
       ;;nav-flash         ; blink cursor line after big motions
       ;;neotree           ; a project drawer, like NERDTree for vim
       ophints             ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       ;;smooth-scroll     ; So smooth you won't believe it's not butter
       ;;tabs              ; a tab bar for Emacs
       (treemacs +lsp)     ; a project drawer, like neotree but cooler
       unicode             ; extended unicode support for various languages
       (vc-gutter +pretty) ; vcs diff in the fringe
       vi-tilde-fringe     ; fringe tildes to mark beyond EOB
       (window-select +numbers)       ; visually switch windows
       workspaces          ; tab emulation, persistence & separate workspaces
       ;;zen               ; distraction-free coding or writing
#+end_src

*** EDITOR
#+begin_src emacs-lisp :tangle init.el

       :editor
       (evil +everywhere)  ; come to the dark side, we have cookies
       file-templates      ; auto-snippets for empty files
       fold                ; (nigh) universal code folding
       (format +onsave +lsp)    ; automated prettiness
       ;;god               ; run Emacs commands without modifier keys
       ;;lispy             ; vim for lisp, for people who don't like vim
       multiple-cursors    ; editing in many places at once
       ;;objed             ; text object editing for the innocent
       ;;parinfer          ; turn lisp into python, sort of
       rotate-text         ; cycle region at point between text candidates
       snippets            ; my elves. They type so I don't have to
       (whitespace +guess +trim)  ; a butler for your whitespace
       word-wrap           ; soft wrapping with language-aware indent
#+end_src

*** EMACS
#+begin_src emacs-lisp :tangle init.el

       :emacs
       (dired +dirvish +icons)      ; making dired pretty [functional]
       electric            ; smarter, keyword-based electric-indent
       ;;eww               ; the internet is gross
       (ibuffer +icons)    ; interactive buffer management
       undo       ; persistent, smarter undo for your inevitable mistakes
       tramp               ; remote files at your arthritic fingertips
       vc                  ; version-control and Emacs, sitting in a tree
#+end_src

*** TERM
#+begin_src emacs-lisp :tangle init.el

       :term
       eshell              ; the elisp shell that works everywhere
       ;;shell             ; simple shell REPL for Emacs
       ;;term              ; basic terminal emulator for Emacs
       vterm               ; the best terminal emulation in Emacs
#+end_src

*** CHECKERs
#+begin_src emacs-lisp :tangle init.el

       :checkers
       (syntax +childframe +flymake +icons)  ; tasing you for every semicolon you forget
       ;;(spell +flyspell) ; tasing you for misspelling mispelling
       ;;grammar           ; tasing grammar mistake every you make
#+end_src

*** TOOLs
#+begin_src emacs-lisp :tangle init.el

       :tools
       ;;ansible
       biblio              ; Writes a PhD for you (citation needed)
       ;;collab            ; buffers with friends
       debugger            ; FIXME stepping through code, to help you add bugs
       ;;direnv
       (docker +lsp +tree-sitter)
       editorconfig        ; let someone else argue about tabs vs spaces
       ;;ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)     ; run code, run (also, repls)
       (lookup +dictionary +docsets)              ; navigate your code and its documentation
       llm                 ; when I said you needed friends, I didn't mean...
       (lsp +peek)         ; M-x vscode
       (magit +forge)      ; a git porcelain for Emacs
       make                ; run make tasks from Emacs
       pass                ; password manager for nerds
       pdf                 ; pdf enhancements
       ;;terraform         ; infrastructure as code
       ;;tmux              ; an API for interacting with tmux
       tree-sitter         ; syntax and parsing, sitting in a tree...
       upload              ; map local to remote projects via ssh/ftp
#+end_src

*** OS
#+begin_src emacs-lisp :tangle init.el

       :os
       tty                 ; improve the terminal Emacs experience
#+end_src

#+begin_src emacs-lisp :tangle (if (string= (org-babel-ref-resolve "get-os-type") "mac") "init.el" "no")
        (:if (featurep :system 'macos) macos)  ; improve compatibility with macOS
#+end_src

